In [3]:
import pandas as pd

# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

store_items = pd.DataFrame(items2, index=['Store 1', 'Store 2', 'Store 3'])
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
Store 1     20      NaN     30    15.0      8   45.0       35
Store 2     15     50.0      5     2.0      5    7.0       10
Store 3     20      4.0     30     NaN     10    NaN       35

In [4]:
x = store_items.isnull()
print(x)

         bikes  glasses  pants  shirts  shoes  suits  watches
Store 1  False     True  False   False  False  False    False
Store 2  False    False  False   False  False  False    False
Store 3  False    False  False    True  False   True    False

In [5]:
# total number of NaNs in data frame
x = store_items.isnull().sum().sum()
print(x)

3

In [6]:
store_items.count()

bikes      3
glasses    2
pants      3
shirts     2
shoes      3
suits      2
watches    3
dtype: int64

In [7]:
store_items.dropna(axis=0)
store_items.dropna(axis=1)
#use inplace to modify the original array

         bikes  pants  shoes  watches
Store 1     20     30      8       35
Store 2     15      5      5       10
Store 3     20     30     10       35

In [8]:
store_items.fillna(0)

         bikes  glasses  pants  shirts  shoes  suits  watches
Store 1     20      0.0     30    15.0      8   45.0       35
Store 2     15     50.0      5     2.0      5    7.0       10
Store 3     20      4.0     30     0.0     10    0.0       35

In [9]:
store_items.fillna(method='ffill', axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
Store 1     20      NaN     30    15.0      8   45.0       35
Store 2     15     50.0      5     2.0      5    7.0       10
Store 3     20      4.0     30     2.0     10    7.0       35

In [10]:
store_items.fillna(method='ffill', axis=1)

         bikes  glasses  pants  shirts  shoes  suits  watches
Store 1   20.0     20.0   30.0    15.0    8.0   45.0     35.0
Store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
Store 3   20.0      4.0   30.0    30.0   10.0   10.0     35.0

In [11]:
#backward filling
store_items.fillna(method='backfill', axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
Store 1     20     50.0     30    15.0      8   45.0       35
Store 2     15     50.0      5     2.0      5    7.0       10
Store 3     20      4.0     30     NaN     10    NaN       35

In [12]:
store_items.interpolate(method='linear', axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
Store 1     20      NaN     30    15.0      8   45.0       35
Store 2     15     50.0      5     2.0      5    7.0       10
Store 3     20      4.0     30     2.0     10    7.0       35

In [13]:
store_items.interpolate(method='linear', axis=1)

         bikes  glasses  pants  shirts  shoes  suits  watches
Store 1   20.0     25.0   30.0    15.0    8.0   45.0     35.0
Store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
Store 3   20.0      4.0   30.0    20.0   10.0   22.5     35.0